#include <iostream>

using namespace std;
//식별자 = Identifier = 인식하다 
//메모리 주소를 프로그래머가 인식할수 있도록 바꿔준다.

int main(){  //main은 시스템이 찾는 첫번째 함수이다.
	
	int 3three(); //함수명은 숫자로 시작하면 안됨
	int . , ; , //등도 안된다.
	
	int value; a; b; //많이 사용함, 가급적이면 너무 길지 않으면 의미를 포함하는 뱐수명이 좋음.
	int num_apples; 나 n_apples 등
		n_a
		n_b //위와 같이 n_은 동일하게 가지고 가고 언더바 뒤로 차별을 두는 경우도 많다.
	//뭐든 코드는 적은게 좋다.
	변수명을 다 외울 필요는 없고, 하다보면 외워진다.
	꾸준히 하는게 중요. 
	//대문자는 변수명으로 잘 안쓴다. shift를 계속 눌러야한다. 번거롭다. 관습적으로 프로그래머들이 사용안한다.
	//유연성을 가지고 다른 이와 작업할때의 변수명을 따라가는게 좋다. 
	
		void MyFu~ //함수명은 대문자로 많이 시작한다
		//GetNumber 앞은 동사 뒤는 명사로 뭐하는 함수인지 작성하는 경우가 많다
		//요즘은 맨 앞을 소문자로 사용하기도 한다
	
	
	return 0;
}